{
    "focus": {
        "translator": "Traductor",
        "copy": "Copiar",
        "email": "Correo",
        "theme": "Tema"
    },
    "button_view": {
        "txt_1": "Ver más",
        "txt_2": "Ver menos"
    },
    "menu": {
        "button_1": "Inicio",
        "button_2": "Sobre mí",
        "button_3": "Servicios",
        "button_4": "Experiencia",
        "button_5": "Proyectos",
        "button_6": "Educacion",
        "button_7": "Contactar",
        "button_8": "Tema"
    },
    "start": {
        "txt_1": "Hola soy",
        "txt_2": "Estoy en la búsqueda de una empresa que me ofrezca la oportunidad de desarrollarme como profesional en el campo de la programación, trabajando en proyectos estimulantes y enriquecedores.",
        "txt_3": "Contactame",
        "txt_4": "Descargar CV",
        "message": {
            "title": "¡Descarga Exitosa!",
            "description": "Si necesitas más información, no dudes en contactarme",
            "buttons": {
                "b_1": "Abrir CV",
                "b_2": "Cerrar"
            }
        },
        "image": {
            "alt": "Imagen de perfil"
        }
    },
    "about": {
        "title": "Sobre mí",
        "subtitle": "¿Por qué me contratan?",
        "description": "Profesional comprometido con la excelencia en mis proyectos, proporcionando recomendaciones de tecnologías y estrategias adecuadas a cada caso específico.",
        "skills": "Habilidades"
    },
    "services": {
        "title": "Servicios",
        "item_1": {
            "txt_1": "Diseño Web",
            "txt_2": "Soluciones personalizadas para potenciar tu presencia en línea. Diseños modernos y funcionales que se adaptan a proyectos variados, incluyendo tiendas en línea, con un enfoque en la experiencia del usuario, garantizando efectividad y originalidad."
        },
        "item_2": {
            "txt_1": "Programacion Especifica",
            "txt_2": "Mi especialización es la programación a medida, lo que implica desarrollar software único y efectivo diseñado específicamente para satisfacer las necesidades individuales de mis clientes."
        },
        "item_3": {
            "txt_1": "Bases de datos",
            "txt_2": "Me especializo en la creación y gestión de bases de datos, asegurando un almacenamiento eficiente y la seguridad de la información. Mi enfoque abarca la optimización de consultas para garantizar sistemas ágiles y confiables."
        }
    },
    "experience": {
        "title": "Experiencia",
        "data": {
            "item_1": {
                "title": "Mesa de ayuda virtual ",
                "description": {
                    "title": "UTN",
                    "date_1": "8 de junio de 2022 - 20 de octubre de 2023",
                    "date_2": "8 jun. 2022 - 20 oct. 2023",
                    "datails": "Formé parte de un equipo de 10 personas y asumí un rol principal en el desarrollo del Frontend, además de colaborar activamente en el diseño de la base de datos. Implementamos metodologías ágiles para gestionar eficazmente el proyecto. Abordamos el problema de la ineficiencia en los trámites académicos, que eran exclusivamente físicos y presenciales. Creamos 'Mesa de Ayuda Virtual' al integrar tres sistemas independientes. Para el Frontend, utilizamos ReactJS, JavaScript, Tailwind, HTML y CSS. En el Backend, empleamos PHP y una base de datos MySQL. El proyecto resultó en un éxito total, con una mejora significativa en la eficiencia de los trámites académicos."
                }
            },
            "item_2": {
                "title": "Calidad de calzados",
                "description": {
                    "title": "UTN",
                    "date_1": "3 de marzo de 2021 - 20 de agosto de 2022",
                    "date_2": "3 mar. 2021 - 20 ago. 2022",
                    "datails": "Lideré un equipo de 5 personas en un proyecto para modernizar la inspección de calidad en una empresa de calzados. Automatizamos manualmente un proceso que resultó en una mejora significativa en la eficiencia de la inspección. En el Frontend, utilizamos JavaScript, TypeScript, CSS, HTML y Tailwind. En el Backend, implementamos Node.js y una base de datos MySQL, junto con motores de plantilla como EJS y Handlebars. Utilizamos Axios para realizar solicitudes HTTP al servidor. Además, llevamos a cabo pruebas exhaustivas con Jest para garantizar la calidad del software. Seguimos metodologías ágiles, como Scrum, para una colaboración eficiente."
                }
            },
            "item_3": {
                "title": "Sysacad Eficiente",
                "description": {
                    "title": "UTN",
                    "date_1": "Logro",
                    "date_2": "Logro",
                    "datails": "Enfrenté un desafío crítico con el sistema Sysacad. Las búsquedas de alumnos eran lentas debido a la falta de indexación en las consultas SQL, lo que ralentizaba el sistema. Para solucionarlo, lideré la creación de un índice en las columnas clave de la base de datos, permitiendo al sistema encontrar datos rápidamente, reduciendo el tiempo de búsqueda de 1 minuto a 0.3 milisegundos. Esta mejora no solo optimizó el sistema, sino que también brindó respuestas casi instantáneas a los usuarios, transformando su experiencia. La indexación se convirtió en una solución esencial para resolver el problema de lentitud en las búsquedas de alumnos en Sysacad."
                }
            },
            "item_4": {
                "title": "Éxito en Proyectos",
                "description": {
                    "title": "UTN",
                    "date_1": "Logro",
                    "date_2": "Logro",
                    "datails": "He completado exitosamente proyectos finales en materias como Sintaxis, Paradigmas, Algoritmos, Diseño web y Diseño de sistemas. Utilizando lenguajes como C/C++, Java, MySQL y Arduino, me he destacado al crear un parser en Java, explorar algoritmos de ordenamiento en C/C++, desarrollar un juego de Pong en Arduino y trabajar con estructuras de datos avanzadas como gramáticas, matrices, grafos, autómatas y expresiones regulares. Durante esta etapa, mi pasión por la optimización del código, la aplicación de patrones de diseño y las buenas prácticas de programación ha sido evidente, lo que ha contribuido a asegurar la calidad y eficiencia en mis proyectos. Siempre que hubo un proyecto final, me propuse firmemente ganar."
                }
            }
        }
    },
    "proyects": {
        "title": "Proyectos",
        "data": {
            "p_1": {
                "title": "Clon YouTube",
                "description": "Decidí embarcarme en este proyecto para poner en práctica mis habilidades. Actualmente, continúo trabajando en la mejora y el perfeccionamiento de esta aplicación.",
                "images": {
                    "main": "Aplicacion YouTube",
                    "logo": "YouTube"
                }
            },
            "p_2": {
                "title": "Clon YouTube",
                "description": "Desarrollé este proyecto, con el objetivo de aprender más sobre el desarrollo de aplicaciones y mejorar mis habilidades como programador.",
                "images": {
                    "main": "Aplicacion YouTube",
                    "logo": "YouTube"
                }
            }
        },
        "buttons": {
            "b_1": "Ver más",
            "b_2": "Ver menos"
        }
    },
    "education": {
        "title": "Educacion",
        "data": {
            "item_1": {
                "institution": "Universidad Tecnológica Nacional",
                "date": "17 de abril de 2019 - En curso",
                "title": "Ingeniería en Sistemas de Información"
            },
            "item_2": {
                "institution": "Cohorte",
                "date": "Expedición: junio 2022",
                "title": "Web Full Stack"
            },
            "item_3": {
                "institution": "Cessi",
                "date": "Expedición: abril 2022",
                "title": "#SéProgramar"
            }
        }
    },
    "contact": {
        "title": "Contactar",
        "inputs": {
            "j_1": "Nombre...",
            "j_2": "Apellido...",
            "j_3": "Correo electrónico...",
            "j_4": "Mensaje..."
        },
        "validations": {
            "inputs": {
                "j_1": {
                    "text_1": "Se requiere un nombre",
                    "text_2": "El nombre debe tener más de 3 caracteres",
                    "text_4": "El nombre solo debe contener letras"
                },
                "j_2": {
                    "text_1": "Se requiere un apellido",
                    "text_2": "El apellido debe tener más de 3 caracteres",
                    "text_4": "El apellido solo debe contener letras"
                },
                "j_3": {
                    "text_1": "Se requiere un correo electrónico",
                    "text_4": "El correo electrónico no es válido"
                },
                "j_4": {
                    "text_1": "Se requiere un mensaje",
                    "text_2": "El mensaje debe tener más de 10 caracteres",
                    "text_4": "El mensaje contiene símbolos no permitidos"
                }
            },
            "recaptcha": {
                "title": "Valida que no sos un robot"
            },
            "message": {
                "type": {
                    "confirmation": {
                        "title": "Mensaje exitoso",
                        "description": "Tu mensaje ha sido enviado con éxito. ¡Gracias por ponerte en contacto! Te responderé lo antes posible."
                    },
                    "warning": {
                        "title": "Comunicación respetuosa",
                        "description": "Su lenguaje ofensivo no es apropiado. Por favor, formule su pregunta o inquietud de manera respetuosa."
                    },
                    "wait": {
                        "title": "Enviando tu mensaje",
                        "description": "Tu mensaje se está enviando. Por favor, espera un momento..."
                    },
                    "error": {
                        "title": "¡Un pequeño contratiempo!",
                        "description": "Lo sentimos, se produjo un error en el envío del mensaje. Por favor, inténtalo de nuevo más tarde. Gracias por tu comprensión."
                    },
                    "copy": {
                        "title": "Correo electrónico copiado con exito"
                    }
                },
                "button": "Aceptar"
            }
        }
    },
    "footer": {
        "title": "Todos los derechos resevados | Diseñado por Beltran Alejo"
    }
}